app/views/static_pages/promotions.html.erb

      </tr>
      <% current_user&.dishes.each do |dish| %>
          <% dish.discounts.scheduled.each do |discount| %>
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."user_id" = $1 AND "dishes"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
SELECT "discounts".* FROM "discounts" WHERE "discounts"."dish_id" = $1 AND ( to_date > '2017-06-09 20:02:53.241581')  [["dish_id", 1]]

          <tr>
            <% if discount_dish.pictures.first %>
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."dish_id" = $1 ORDER BY "pictures"."id" ASC LIMIT $2  [["dish_id", 1], ["LIMIT", 1]]