app/views/users/index.html.erb

SELECT "users".* FROM "users"
---
          <td class="users-table"><%= user.id %></td>
          <td class="users-table"><%= user.first_name %></td>