app/views/carts/delete.js.erb

$('.delete_item').bind('ajax:success', function() {
        $(this).closest('tr').fadeOut();
});
---
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 2]]