app/views/dishes/index.html.erb

SELECT "dishes".* FROM "dishes"
---
          <td class="dishes-table"><%= dish.price %></td>
          <td class="dishes-table"><%= dish.user.first_name %> <%= dish.user.last_name %></td>