app/views/dishes/show.html.erb

  <% end %>
  <% if @dish.pictures.first %>
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."dish_id" = $1 ORDER BY "pictures"."id" ASC LIMIT $2  [["dish_id", 20], ["LIMIT", 1]]

		<ul id="comments-list" class="comments-list">
      <% Review.where(dish_id: @dish.id).each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."dish_id" = $1  [["dish_id", 1]]

          <!-- Avatar -->
          <% if review.user.avatar.present? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]