app/controllers/carts_controller.rb

  def show
    @order_items = current_order.order_items
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", 2]]