app/controllers/cooks_controller.rb

SELECT "cooks".* FROM "cooks"
---
  def index
    @cooks = Cook.all

SELECT  "cooks".* FROM "cooks" WHERE "cooks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @cook = Cook.find(params[:id])

INSERT INTO "cooks" ("first_name", "last_name", "email", "password", "password_confirmation", "address", "phone", "gender", "birth_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @cook = Cook.new(cook_params)

    respond_to do |format|
      if @cook.save

SELECT  "cooks".* FROM "cooks" WHERE "cooks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_cook
      @cook = Cook.find(params[:id])