app/controllers/discounts_controller.rb

SELECT "discounts".* FROM "discounts"
---
  def index
    @discounts = Discount.all

UPDATE "discounts" SET "discount_percent" = $1, "from_date" = $2, "to_date" = $3, "updated_at" = $4 WHERE "discounts"."id" = $5  [["discount_percent", 10], ["from_date", 2017-06-09 22:44:00 UTC], ["to_date", 2017-07-17 22:44:00 UTC], ["updated_at", 2017-06-09 20:32:19 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @discount.update(discount_params)

SELECT  "discounts".* FROM "discounts" WHERE "discounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_discount
      @discount = Discount.find(params[:id])