app/controllers/dishes_controller.rb

SELECT "dishes".* FROM "dishes"
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."dish_id" = $1  [["dish_id", 21]]
SELECT COUNT(*) FROM "dishes"
SELECT  "dishes".* FROM "dishes" ORDER BY created_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 8], ["OFFSET", 0]]
---
  def index
    if params[:tag]
      @dishes = Dish.tagged_with(params[:tag]).paginate(per_page: 12, page: params[:page])
    else
      @dishes = Dish.paginate(:per_page => 12, page: params[:page])

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."dish_id" = $1 LIMIT $2 OFFSET $3  [["dish_id", 20], ["LIMIT", 5], ["OFFSET", 0]]
SELECT "pictures".* FROM "pictures" WHERE "pictures"."dish_id" = $1  [["dish_id", 20]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."dish_id" = $1  [["dish_id", 1]]
---
  def show
    @dish = Dish.find(params[:id])
    @pictures = @dish.pictures
    @reviews = @dish.reviews.paginate(per_page: 5, page: params[:page])

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND (dish_id = 21) ORDER BY "cart_items"."id" ASC LIMIT $2  [["cart_id", 2], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = $1, "updated_at" = $2 WHERE "cart_items"."id" = $3  [["amount", 2], ["updated_at", 2017-06-09 20:53:53 UTC], ["id", 4]]
INSERT INTO "cart_items" ("dish_id", "cart_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["dish_id", 21], ["cart_id", 2], ["amount", 1], ["created_at", 2017-06-09 20:50:25 UTC], ["updated_at", 2017-06-09 20:50:25 UTC]]
---
  def add_to_cart
    if session[:cart_id].blank?
      cart = Cart.create(status: 'pending')
      session[:cart_id] = cart.id
    else
      cart = Cart.find(session[:cart_id])
    end
      @dish = Dish.find(params[:id])
      item = cart.cart_items.where("dish_id = ?", @dish.id).first
      if item.present?
        item.update(amount: item.amount + 1)
      else
        cart.cart_items.create(dish_id: @dish.id, amount: 1)

INSERT INTO "dishes" ("name", "price", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "a"], ["price", 1], ["description", ""], ["created_at", 2017-04-21 11:40:48 UTC], ["updated_at", 2017-04-21 11:40:48 UTC]]
---
  def create
    @dish = Dish.new(dish_params)
    @dish.user_id = current_user.id

    respond_to do |format|
      if @dish.save

DELETE FROM "dishes" WHERE "dishes"."id" = $1  [["id", 1]]
---
  def destroy
    @dish.destroy

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_dish
    @dish = Dish.find(params[:id])