app/controllers/orders_controller.rb

SELECT  1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = $1 LIMIT $2  [["cart_id", 2], ["LIMIT", 1]]
---
  def checkout
    @cart = current_cart
    if @cart.cart_items.empty?