app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "fekunze@uc.cl"], ["LIMIT", 1]]
---
  def create
    if auth_hash.present?
      @user = User.find_or_create_from_auth_hash(auth_hash)
      session[:user_id] = @user.id
      redirect_back_or dishes_path
    else
      @user = User.find_by(email: params[:session][:email].downcase)