app/views/layouts/_dish_item.html.erb

  <section align="center">
    <% if dish.discounts.active.size > 0 %>
---
SELECT  "discounts".* FROM "discounts" WHERE "discounts"."dish_id" = $1 AND ('2017-06-09 20:06:10.853085' BETWEEN from_date AND to_date) ORDER BY "discounts"."id" DESC LIMIT $2  [["dish_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "discounts" WHERE "discounts"."dish_id" = $1 AND ('2017-06-09 20:06:10.851114' BETWEEN from_date AND to_date)  [["dish_id", 1]]

    <div class="fotorama">
      <% if dish.pictures.first %>
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."dish_id" = $1 ORDER BY "pictures"."id" ASC LIMIT $2  [["dish_id", 1], ["LIMIT", 1]]

  <div align="right">
    <% if dish.user.avatar.present? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    <h4 align="center">
      <% if dish.tags.size > 0 %>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."dish_id" = $1  [["dish_id", 1]]

      <h5 align="center" class="dish-categories">Categories: </h6>
      <h6 align="center" class="dish-categories"><%= raw dish.categories.map { |t| link_to t.name, category_path(t) }.join(', ') %></h6>
---
SELECT "categories".* FROM "categories" INNER JOIN "categorizings" ON "categories"."id" = "categorizings"."category_id" WHERE "categorizings"."dish_id" = $1  [["dish_id", 1]]